#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

          + "https://phlat-dev.hlth.gov.bc.ca/*",
        ]
      + web_origins                               = [
          + "+",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-WEB.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-PHLAT will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-PHLAT" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "PHLAT"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "PHLAT Role Mapper"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.module.client-roles.keycloak_role.ROLES["REG_ADMIN"] will be destroyed
  # (because keycloak_role.ROLES is not in configuration)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "39a9c6bf-6a77-426f-bc79-86d4515716cf" -> null
      - id         = "8d123147-9bb8-46be-bf07-26ac295d693f" -> null
      - name       = "REG_ADMIN" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.module.client-roles.keycloak_role.ROLES["REG_USER"] will be destroyed
  # (because keycloak_role.ROLES is not in configuration)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "39a9c6bf-6a77-426f-bc79-86d4515716cf" -> null
      - id         = "bdc8b655-06c0-4359-8fef-698b6e56f3c5" -> null
      - name       = "REG_USER" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-WEB.module.client-roles.keycloak_role.ROLES["REG_ADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REG_ADMIN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-WEB.module.client-roles.keycloak_role.ROLES["REG_USER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REG_USER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-phlat"] will be destroyed
  # (because key ["USER-MANAGEMENT-SERVICE/view-client-phlat"] is not in for_each map)
  - resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      - client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d" -> null
      - id        = "moh_applications/client/cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/e7c5b6c6-bc07-439f-8014-57817dca43dc" -> null
      - realm_id  = "moh_applications" -> null
      - role_id   = "e7c5b6c6-bc07-439f-8014-57817dca43dc" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-phlat-web"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-phlat"] will be destroyed
  # (because key ["view-client-phlat"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "ab6e0d99-9205-4625-8ea4-88835ddd36ae" -> null
      - id         = "e7c5b6c6-bc07-439f-8014-57817dca43dc" -> null
      - name       = "view-client-phlat" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-phlat-web"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-phlat-web"
      + realm_id  = "moh_applications"
    }

Plan: 7 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*